<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="encoder_hidden_states" type="Parameter" version="opset1">
			<data shape="?,?,1280" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_101638_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="0" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_101638" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Transpose_101267_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="2560" size="3276800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_101267" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model/decoder/layers.1/encoder_attn/v_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.1/encoder_attn/v_proj/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/model/decoder/layers.1/encoder_attn/v_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.1/encoder_attn/v_proj/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model.decoder.embed_tokens.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="51865, 1280" offset="3279360" size="132774400" />
			<output>
				<port id="0" precision="FP16">
					<dim>51865</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model.decoder.embed_tokens.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>51865</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.decoder.embed_tokens.weight">
					<dim>51865</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/model/decoder/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="136053760" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/model/decoder/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_92095" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="/model/decoder/embed_tokens/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>51865</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/decoder/embed_tokens/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model.decoder.embed_positions.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="448, 1280" offset="136053784" size="1146880" />
			<output>
				<port id="0" precision="FP16">
					<dim>448</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model.decoder.embed_positions.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>448</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.decoder.embed_positions.weight">
					<dim>448</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model/decoder/embed_positions/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/model/decoder/embed_positions/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/embed_positions/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_99478" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_92332" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="20" name="/model/decoder/embed_positions/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/embed_positions/Gather_output_0,/model/decoder/embed_positions/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model/decoder/embed_positions/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model/decoder/embed_positions/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/model/decoder/embed_positions/Slice_output_0">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/model/decoder/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/Add_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_101644_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="137200672" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_101644" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Range_92345" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137203232" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MVN_92346" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_101639_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="137203240" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_101639" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_92347" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_101640_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="137205800" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_101640" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model/decoder/layers.0/self_attn_layer_norm/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/LayerNormalization_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Multiply_101485_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="137208360" size="3276800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Multiply_101485" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Multiply_101469" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_101641_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="140485160" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_101641" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model/decoder/layers.0/self_attn/Mul" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/model/decoder/layers.0/self_attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/layers.0/self_attn/Shape_1_output_0,/model/decoder/layers.0/self_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_99513" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="140487720" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_99514" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="43" name="Gather_99515" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model/decoder/layers.0/self_attn/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487736" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model/decoder/layers.0/self_attn/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487744" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model/decoder/layers.0/self_attn/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model/decoder/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_92396" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="140487752" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model/decoder/layers.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_99481" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_92351" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="52" name="/model/decoder/layers.0/self_attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Gather_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_13_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_15_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_1_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_2_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_7_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_99459" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487736" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/model/decoder/layers.0/self_attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/layers.0/self_attn/Mul_1_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_10_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_4_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_5_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/model/decoder/layers.0/self_attn/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137203232" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model/decoder/layers.0/self_attn/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487744" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model/decoder/layers.0/self_attn/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Concat_3_output_0,/model/decoder/layers.0/self_attn/Concat_4_output_0,/model/decoder/layers.0/self_attn/Concat_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model/decoder/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Reshape_3_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Transpose_101291_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="140487784" size="3276800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transpose_101291" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model/decoder/layers.0/self_attn/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/k_proj/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/model/decoder/layers.0/self_attn/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137203232" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model/decoder/layers.0/self_attn/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487736" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/model/decoder/layers.0/self_attn/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487744" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/model/decoder/layers.0/self_attn/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/decoder/layers.0/self_attn/Concat_1_output_0,/model/decoder/layers.0/self_attn/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model/decoder/layers.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_92376" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="140487752" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="present.0.decoder.key" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.key">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/model/decoder/layers.0/self_attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Reshape_4_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model/decoder/layers.0/self_attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model/decoder/layers.0/self_attn/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="140487736" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_19_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_99484" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_92355" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="74" name="/model/decoder/layers.0/self_attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Gather_1_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_11_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_14_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_16_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_3_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model/decoder/layers.0/self_attn/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/layers.0/self_attn/Shape_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_99487" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_92601" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="78" name="/model/decoder/layers.0/self_attn/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Gather_2_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_12_output_0,/model/decoder/layers.0/self_attn/Unsqueeze_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model/decoder/layers.0/self_attn/Concat_6" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/decoder/layers.0/self_attn/Concat_6_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/model/decoder/layers.0/self_attn/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Reshape_6_output_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/model/decoder/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_7_output_0" />
			</output>
		</layer>
		<layer id="82" name="Constant_92104" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="143764584" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="/model/decoder/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/Shape_1_output_0,/model/decoder/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_99518" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="143764588" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_99519" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="86" name="Gather_99520" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/Concat_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/model/decoder/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/ConstantOfShape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model/decoder/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/Shape_2_output_0,/model/decoder/Shape_3_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_138496" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137203232" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_138495" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="143764604" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_138494" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StridedSlice_138497" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="1" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/decoder/Cast_output_0,/model/decoder/Squeeze_1_output_0,/model/decoder/Squeeze_output_0" />
			</output>
		</layer>
		<layer id="93" name="/model/decoder/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="137200664" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="94" name="/model/decoder/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_101642" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/model/decoder/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Add_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_222" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_584">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model/decoder/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/model/decoder/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model/decoder/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Concat_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/model/decoder/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model/decoder/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model/decoder/Cast_1_output_0,/model/decoder/Less_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model/decoder/Constant_15_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="143764612" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="104" name="/model/decoder/Constant_15" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/decoder/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="105" name="/model/decoder/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/decoder/Cast_2_output_0,/model/decoder/Where_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/model/decoder/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136053776" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model/decoder/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/Unsqueeze_4_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model/decoder/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_17_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/model/decoder/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/Unsqueeze_5_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_99490" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_92083" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="112" name="/model/decoder/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/Gather_output_0,/model/decoder/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/model/decoder/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_19_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_99475" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137200664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_92087" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136053776" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="116" name="/model/decoder/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/Gather_1_output_0,/model/decoder/Unsqueeze_1_output_0,/model/decoder/Unsqueeze_2_output_0,/model/decoder/Unsqueeze_7_output_0,/model/decoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/model/decoder/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Sub_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/model/decoder/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Add_1_output_0,/model/decoder/Unsqueeze_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/model/decoder/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/decoder/Concat_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_139029" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="137203232" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/model/decoder/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Reshape_2_output_0">
					<dim>4</dim>
