<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="input_features" type="Parameter" version="opset1">
			<data shape="?,?,3000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input_features">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_features/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="2" name="input_features/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="3" name="input_features/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="4" name="input_features/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="input_features/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1707755" type="Const" version="opset1">
			<data element_type="i8" shape="1280, 80, 3" offset="8" size="307200" />
			<output>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Convert_1707756" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_1707757" type="Const" version="opset1">
			<data element_type="f32" shape="1280, 1, 1" offset="307208" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.conv1/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1280</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.conv1/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.conv1/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1280, 1" offset="312328" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.conv1/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.conv1/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="73">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="aten::gelu/Gelu/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="314888" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="16" name="aten::gelu/Gelu/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="314892" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="17" name="aten::gelu/Gelu/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="314888" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="18" name="aten::gelu/Gelu/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="314892" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="19" name="aten::gelu/Gelu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_1707760" type="Const" version="opset1">
			<data element_type="i8" shape="1280, 1280, 3" offset="314896" size="4915200" />
			<output>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_1707761" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_1707762" type="Const" version="opset1">
			<data element_type="f32" shape="1280, 1, 1" offset="5230096" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.conv2/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.conv2/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.conv2/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1280, 1" offset="5235216" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.conv2/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.conv2/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="aten::gelu/Gelu_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="76,inputs_embeds.1">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_172" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5237776" size="24" />
			<output>
				<port id="0" precision="I64" names="80">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="81,inputs_embeds">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_84528_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1500, 1280" offset="5237800" size="3840000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_84528" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="83,input.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="9077800" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_84529_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="9077804" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_84529" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_84530_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="9080364" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_84530" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="168,hidden_states.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="9082924" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9088044" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="45" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9088048" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="46" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9088044" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9088048" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="48" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_1707765" type="Const" version="opset1">
			<data element_type="i8" shape="1280, 1280" offset="9088052" size="1638400" />
			<output>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Convert_1707766" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_1707767" type="Const" version="opset1">
			<data element_type="f32" shape="1280, 1" offset="10726452" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Multiply_83782/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Multiply_83782" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_84531_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="10731572" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_84531" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.layers.0.self_attn/aten::mul/Multiply" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="179,tensor.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.layers.0.self_attn/aten::mul/Multiply/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="10734132" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="__module.layers.0.self_attn/aten::mul/Multiply/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="10734136" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="59" name="__module.layers.0.self_attn/aten::mul/Multiply/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="10734132" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="__module.layers.0.self_attn/aten::mul/Multiply/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="10734136" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="61" name="__module.layers.0.self_attn/aten::mul/Multiply/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.layers.0.self_attn/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_145282" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10734140" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.layers.0.self_attn/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10734148" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="65" name="__module.layers.0.self_attn/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="173">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.layers.0.self_attn/prim::ListConstruct/Reshape_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10734152" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.layers.0.self_attn/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10734160" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.layers.0.self_attn/prim::ListConstruct/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10734168" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.layers.0.self_attn/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="197">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="198">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.layers.0.self_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="10734176" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="199">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_145186" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10734160" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="193,194,195,196">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.layers.0.self_attn/prim::ListConstruct/Reshape_0_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10734192" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.layers.0.self_attn/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="201,203,205">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="202">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_1707770" type="Const" version="opset1">
			<data element_type="i8" shape="1280, 1280" offset="10734200" size="1638400" />
			<output>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Convert_1707771" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_1707772" type="Const" version="opset1">
			<data element_type="f32" shape="1280, 1" offset="12372600" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="181,tensor.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12377720" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="84" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12377724" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12377720" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="86" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12377724" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.layers.0.self_attn/prim::ListConstruct/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="182,189">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.layers.0.self_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="183">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="10734176" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="184">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.layers.0.self_attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204,key_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.layers.0.self_attn/aten::bmm/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208,attn_weights.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.layers.0.self_attn/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="209,input.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_1707775" type="Const" version="opset1">
			<data element_type="i8" shape="1280, 1280" offset="12377728" size="1638400" />
			<output>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Convert_1707776" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_1707777" type="Const" version="opset1">
			<data element_type="f32" shape="1280, 1" offset="14016128" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.layers.0.self_attn.v_proj/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.layers.0.self_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_84532_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1280" offset="14021248" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_84532" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.layers.0.self_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188,tensor.3">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.layers.0.self_attn/aten::view/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="190">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_3" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="10734176" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.layers.0.self_attn/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.layers.0.self_attn/aten::reshape/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.layers.0.self_attn/aten::bmm/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="211,attn_output.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.layers.0.self_attn/prim::ListConstruct/Concat_6" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="212">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.layers.0.self_attn/aten::view/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213,attn_output.3">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_4" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="10734176" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.layers.0.self_attn/aten::transpose/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214,attn_output.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.layers.0.self_attn/prim::ListConstruct/Reshape_1_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14023808" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.layers.0.self_attn/prim::ListConstruct/Concat_7" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="215">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.layers.0.self_attn/aten::reshape/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="216">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="14023816" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="14028936" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="118" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="14028940" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="119" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="14028936" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="120" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="14028940" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="121" name="__module.layers.0.self_attn/aten::reshape/Reshape_2_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_1707780" type="Const" version="opset1">
			<data element_type="i8" shape="1280, 1280" offset="14028944" size="1638400" />
			<output>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Convert_1707781" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_1707782" type="Const" version="opset1">
			<data element_type="f32" shape="1280, 1" offset="15667344" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.layers.0.self_attn.out_proj/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.layers.0.self_attn.out_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
